tutorials/topoSetShapes/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// A single 3 x 3 x 3 cube. All topoSetDict sources in system/topoSetDict are
// placed inside this domain so every shape is visible in the 3-D panel.

vertices
(
    (0 0 0)  // v0
    (3 0 0)  // v1
    (3 3 0)  // v2
    (0 3 0)  // v3
    (0 0 3)  // v4
    (3 0 3)  // v5
    (3 3 3)  // v6
    (0 3 3)  // v7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1 1 1)
);

edges ( );

boundary
(
    xMin
    {
        type patch;
        faces ( (0 4 7 3) );
    }
    xMax
    {
        type patch;
        faces ( (1 2 6 5) );
    }
    yMin
    {
        type patch;
        faces ( (0 1 5 4) );
    }
    yMax
    {
        type patch;
        faces ( (3 7 6 2) );
    }
    zMin
    {
        type patch;
        faces ( (0 3 2 1) );
    }
    zMax
    {
        type patch;
        faces ( (4 5 6 7) );
    }
);

// ************************************************************************* //
